      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ISOGRAM.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PHRASE PIC X(60).
       01 WS-RESULT PIC 99.
       01 THELOWCASEALPHABET PIC X(26)
           VALUE "**************************".
       01 WS-INDEX1 PIC 9(2) VALUE 1.
       01 WS-INDEX2 PIC 9(2) VALUE 1.

       PROCEDURE DIVISION.


       ISOGRAM.
       MOVE 1 TO WS-RESULT.

       PERFORM VARYING WS-INDEX1 FROM 1 BY 1 UNTIL WS-INDEX1 > 60
         PERFORM VARYING WS-INDEX2 FROM 1 BY 1 UNTIL WS-INDEX2 > 26
           IF WS-PHRASE(WS-INDEX1:1) EQUALS " " OR
             WS-PHRASE(WS-INDEX1:1) EQUAL "-" THEN
             EXIT PERFORM
           END-IF

           IF WS-PHRASE(WS-INDEX1:1) EQUALS
             THELOWCASEALPHABET(WS-INDEX2:1) THEN
             MOVE ZERO TO WS-RESULT
             PERFORM END-OF-PROGRAM
           END-IF
           IF WS-PHRASE(WS-INDEX1:1) EQUALS
             FUNCTION UPPER-CASE(THELOWCASEALPHABET(WS-INDEX2:1))
             THEN
             MOVE ZERO TO WS-RESULT
             PERFORM END-OF-PROGRAM
           END-IF

           IF THELOWCASEALPHABET(WS-INDEX2:1) EQUAL "*" THEN
             MOVE WS-PHRASE(WS-INDEX1:1) TO
             THELOWCASEALPHABET(WS-INDEX2:1)
             EXIT PERFORM
           END-IF

         END-PERFORM
       END-PERFORM.

       ISOGRAM-END.

       END-OF-PROGRAM.
            STOP RUN.
       END PROGRAM ISOGRAM.
