      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. armstrong-numbers.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY. FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUMBER PIC X(8).
       01 WS-NUMBER2 PIC 9(8).
       01 WS-RESULT PIC 9.
       01 DIGITS    PIC 9.
       01 CONTADOR  PIC 9.
       01 TEMP      PIC 9.
       01 TEMP2     PIC 9(9).

       PROCEDURE DIVISION.

       ARMSTRONG-NUMBERS.
       INITIALIZE CONTADOR DIGITS WS-RESULT TEMP2 TEMP.

       INSPECT WS-NUMBER TALLYING TEMP FOR ALL SPACES.
       COMPUTE DIGITS = (LENGTH OF WS-NUMBER) - TEMP.

       MOVE WS-NUMBER TO WS-NUMBER2.

       PERFORM VARYING CONTADOR FROM 1 BY 1 UNTIL CONTADOR > 8
         MOVE WS-NUMBER2(CONTADOR:1) TO TEMP
         COMPUTE TEMP2 = TEMP2 + (TEMP ** DIGITS)
       END-PERFORM.
       IF TEMP2 = WS-NUMBER2 THEN MOVE 1 TO WS-RESULT END-IF.
