      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. luhn.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY. FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CARD-NUMBER PIC X(32).
       01 WS-CARD-DIGITS PIC 9(32).
       01 WS-CHECKSUM PIC 9(2).
       01 WS-VALID PIC X(5).
       01 WS-TEMP PIC 9.
       01 CONTADOR PIC 9(3).
       01 CONTADOR2 PIC 9(3).

       PROCEDURE DIVISION.

       LUHN.
       INITIALIZE WS-CARD-DIGITS
                  CONTADOR.
       MOVE 1 TO CONTADOR2.

       PERFORM VARYING CONTADOR FROM 1 BY 1 UNTIL CONTADOR > 32
         IF WS-CARD-NUMBER(CONTADOR:1) NUMERIC THEN
           MOVE WS-CARD-NUMBER(CONTADOR:1) TO WS-TEMP
           IF FUNCTION MOD(CONTADOR2,2) NOT = 0 THEN
             IF WS-CARD-NUMBER(CONTADOR:1) > 4 THEN
               COMPUTE WS-TEMP =  (WS-TEMP *2) - 9 END-COMPUTE
               MOVE WS-TEMP TO WS-CARD-DIGITS(CONTADOR2:1)
               ADD 1 TO CONTADOR2
             ELSE
               COMPUTE WS-TEMP =  WS-TEMP *2  END-COMPUTE
               MOVE WS-TEMP TO WS-CARD-DIGITS(CONTADOR2:1)
               ADD 1 TO CONTADOR2
             END-IF
           ELSE
             MOVE WS-CARD-NUMBER(CONTADOR:1)
             TO WS-CARD-DIGITS(CONTADOR2:1)
             ADD 1 TO CONTADOR2
           END-IF
         ELSE
           IF WS-CARD-NUMBER(CONTADOR:1) NOT = SPACE
             MOVE "FALSE" TO WS-VALID
             PERFORM END-OF-PROGRAM
           END-IF
         END-IF
       END-PERFORM.

       MOVE 1 TO CONTADOR
       PERFORM VARYING CONTADOR FROM 1 BY 1 UNTIL CONTADOR > 32
         MOVE WS-CARD-DIGITS(CONTADOR:1) TO WS-TEMP
         COMPUTE WS-CHECKSUM = WS-CHECKSUM + WS-TEMP END-COMPUTE
       END-PERFORM.

       IF FUNCTION MOD(WS-CHECKSUM,10) = 0 THEN
         MOVE "VALID" TO WS-VALID
       ELSE
         MOVE "FALSE" TO WS-VALID
       END-IF.



       END-OF-PROGRAM.
           STOP RUN.
       END PROGRAM luhn.
