      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. rotational-cipher.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-KEY PIC 9(2).
       01 WS-TEXT PIC X(128).
       01 WS-CIPHER PIC X(128).
       01 THELOWCASEALPHABET PIC X(26)
           VALUE "abcdefghijklmnopqrstuvwxyz".
       01 WS-INDEX1 PIC 9(3) VALUE 1.
       01 WS-INDEX2 PIC 9(2) VALUE 1.
       01 SUM-NUMBER PIC 9(2).

       PROCEDURE DIVISION.


       ROTATIONAL-CIPHER.
       PERFORM VARYING WS-INDEX1 FROM 1 BY 1 UNTIL WS-INDEX1 > 128
         PERFORM VARYING WS-INDEX2 FROM 1 BY 1 UNTIL WS-INDEX2 > 26


           IF WS-TEXT(WS-INDEX1:1) EQUALS
             THELOWCASEALPHABET(WS-INDEX2:1) OR
             WS-TEXT(WS-INDEX1:1) EQUALS
             FUNCTION UPPER-CASE(THELOWCASEALPHABET(WS-INDEX2:1)) THEN

             MOVE WS-INDEX2 TO SUM-NUMBER
             PERFORM CALCULATE-POSITION

             MOVE FUNCTION UPPER-CASE(THELOWCASEALPHABET(SUM-NUMBER:1))
             TO WS-CIPHER(WS-INDEX1:1)
             EXIT PERFORM
           END-IF

           IF WS-INDEX2 EQUAL 26 THEN
             MOVE WS-TEXT(WS-INDEX1:1) TO WS-CIPHER(WS-INDEX1:1)
             EXIT PERFORM
           END-IF

         END-PERFORM
       END-PERFORM.
       ROTATIONAL-CIPHER-END.


       CALCULATE-POSITION.
         COMPUTE SUM-NUMBER = SUM-NUMBER + WS-KEY.
         IF SUM-NUMBER > 26 THEN
           COMPUTE SUM-NUMBER = SUM-NUMBER - 26
         END-IF.
       CALCULATE-POSITION-END.


       END-OF-PROGRAM.
            STOP RUN.
       END PROGRAM rotational-cipher.
