      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. reverse-string.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STRING PIC X(64).
       01 STRING-REV PIC X(64).
       01 CONTADOR PIC 99.
       01 WS-SPACE-COUNT PIC 9(2) VALUE 0.

       PROCEDURE DIVISION.

       REVERSE-STRING.

      * Reverse a string and display result

       PERFORM VARYING CONTADOR FROM 1 BY 1 UNTIL CONTADOR > 64
         MOVE WS-STRING(CONTADOR:1) TO STRING-REV((65 - CONTADOR):1)
       END-PERFORM.

       INSPECT STRING-REV TALLYING WS-SPACE-COUNT FOR LEADING SPACE.
       MOVE FUNCTION TRIM(STRING-REV) TO WS-STRING.

       MOVE STRING-REV TO WS-STRING.

       INSPECT STRING-REV TALLYING WS-SPACE-COUNT FOR LEADING SPACE.
       MOVE FUNCTION TRIM(STRING-REV) TO WS-STRING

       DISPLAY WS-STRING.

       REVERSE-STRING-END.



       END-OF-PROGRAM.
            STOP RUN.
       END PROGRAM reverse-string.
