      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. difference-of-squares.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DIFFERENCE-OF-SQUARES PIC 9(8).
       01 WS-SUM-OF-SQUARES PIC 9(8).
       01 WS-SQUARE-OF-SUM PIC 9(8).
       01 WS-NUMBER PIC 9(8).
       01 CONTADOR PIC 9(5).

       PROCEDURE DIVISION.


       SQUARE-OF-SUM.
       INITIALIZE WS-SQUARE-OF-SUM.

       PERFORM VARYING CONTADOR FROM 1 BY 1 UNTIL CONTADOR > WS-NUMBER
         COMPUTE WS-SQUARE-OF-SUM = WS-SQUARE-OF-SUM + CONTADOR
         END-COMPUTE
       END-PERFORM.
       COMPUTE WS-SQUARE-OF-SUM = WS-SQUARE-OF-SUM * WS-SQUARE-OF-SUM
       END-COMPUTE.
       SQUARE-OF-SUM-END.


       SUM-OF-SQUARES.
       INITIALIZE WS-SUM-OF-SQUARES.

       PERFORM VARYING CONTADOR FROM 1 BY 1 UNTIL CONTADOR > WS-NUMBER
         COMPUTE WS-SUM-OF-SQUARES = WS-SUM-OF-SQUARES +
                 (CONTADOR * CONTADOR)
         END-COMPUTE
       END-PERFORM.

       SUM-OF-SQUARES-END.


       DIFFERENCE-OF-SQUARES.
       INITIALIZE WS-DIFFERENCE-OF-SQUARES.

       COMPUTE WS-DIFFERENCE-OF-SQUARES =
               WS-SQUARE-OF-SUM - WS-SUM-OF-SQUARES
       END-COMPUTE.
       DIFFERENCE-OF-SQUARES-END.




       END-OF-PROGRAM.
           STOP RUN.
       END PROGRAM difference-of-squares.
