       IDENTIFICATION DIVISION.
       PROGRAM-ID. allergies.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SCORE       PIC 999.
       01 WS-ITEM        PIC X(12).
       01 WS-RESULT      PIC A.
       01 WS-RESULT-LIST PIC X(108).

       01 TEMP PIC 9.
       01 CONTADOR PIC 9.

       01 THELIST PIC X(12) OCCURS 8 TIMES.
       01 TEMPLIST PIC 9 OCCURS 8 TIMES.

       01 CONTADOR2 PIC 9.

       PROCEDURE DIVISION.
       MOVE "eggs" TO THELIST(1).
       MOVE "peanuts" TO THELIST(2).
       MOVE "shellfish" TO THELIST(3).
       MOVE "strawberries" TO THELIST(4).
       MOVE "tomatoes" TO THELIST(5).
       MOVE "chocolate" TO THELIST(6).
       MOVE "pollen" TO THELIST(7).
       MOVE "cats" TO THELIST(8).


       ALLERGIC-TO.
       PERFORM INITIALIZEVARIABLES.
       PERFORM VARYING TEMP FROM 1 BY 1 UNTIL TEMP = 8
         IF WS-ITEM = THELIST(TEMP)
           EXIT PERFORM END-IF
       END-PERFORM.

       PERFORM UNTIL WS-SCORE < 1
         PERFORM THEALGORITHM
         COMPUTE WS-SCORE = WS-SCORE - (2 ** (CONTADOR - 1))
         IF CONTADOR = TEMP THEN
           MOVE "Y" TO WS-RESULT
           EXIT PERFORM
         END-IF
       END-PERFORM.
       PERFORM END-OF-PROGRAM.
       ALLERGIC-TO-END.


       LIST-ALLERGENS.
       PERFORM INITIALIZEVARIABLES.
       PERFORM UNTIL WS-SCORE < 1
         PERFORM THEALGORITHM
         COMPUTE WS-SCORE = WS-SCORE - (2 ** (CONTADOR - 1))
         MOVE CONTADOR TO TEMPLIST(8 - CONTADOR2)
         ADD 1 TO CONTADOR2
       END-PERFORM.

       INITIALIZE CONTADOR2.
       PERFORM UNTIL CONTADOR2 > 7
         IF TEMPLIST(CONTADOR2) NOT = ZERO THEN
           IF WS-RESULT-LIST = SPACES THEN
             MOVE THELIST(TEMPLIST(CONTADOR2)) TO WS-RESULT-LIST
           ELSE
             STRING WS-RESULT-LIST "," THELIST(TEMPLIST(CONTADOR2))
             DELIMITED BY ALL " "
             INTO WS-RESULT-LIST
           END-IF
         END-IF
         ADD 1 TO CONTADOR2
       END-PERFORM.
       PERFORM END-OF-PROGRAM.
       LIST-ALLERGENS-END.


       THEALGORITHM.
       MOVE 1 TO CONTADOR.
       PERFORM UNTIL (2 ** CONTADOR) > WS-SCORE
         ADD 1 TO CONTADOR
       END-PERFORM.
       THEALGORITHM-END.


       INITIALIZEVARIABLES.
       MOVE "N" TO WS-RESULT.
       PERFORM VARYING CONTADOR FROM 1 BY 1 UNTIL CONTADOR > 8
         INITIALIZE TEMPLIST(CONTADOR)
       END-PERFORM.
       INITIALIZE TEMP CONTADOR CONTADOR2 WS-RESULT-LIST.
       INITIALIZEVARIABLES-END.

       END-OF-PROGRAM.
            STOP RUN.
       END PROGRAM allergies.
