      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PANGRAM.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SENTENCE PIC X(60).

       01 THELOWCASEALPHABET PIC X(26).

       01 COUNTERSENTENCE PIC 99.
       01 COUNTERALPHABET PIC 99.

       01 WS-RESULT PIC 9.

       PROCEDURE DIVISION.

       PANGRAM.
         MOVE "abcdefghijklmnopqrstuvwxyz" TO THELOWCASEALPHABET.
         INITIALIZE  COUNTERSENTENCE
                     COUNTERALPHABET
                     WS-RESULT.

         PERFORM VARYING COUNTERSENTENCE FROM 1 BY 1
                         UNTIL COUNTERSENTENCE > 60
           PERFORM VARYING COUNTERALPHABET FROM 1 BY 1
                         UNTIL COUNTERALPHABET > 26

             IF WS-SENTENCE(COUNTERSENTENCE:1) EQUALS
                THELOWCASEALPHABET(COUNTERALPHABET:1) THEN
                MOVE "*" TO THELOWCASEALPHABET(COUNTERALPHABET:1)
             ELSE
               IF WS-SENTENCE(COUNTERSENTENCE:1) EQUALS
                 FUNCTION
                 UPPER-CASE(THELOWCASEALPHABET(COUNTERALPHABET:1)) THEN
                 MOVE "*" TO THELOWCASEALPHABET(COUNTERALPHABET:1)
               END-IF
             END-IF

           END-PERFORM
         END-PERFORM.

         IF THELOWCASEALPHABET EQUAL "**************************" THEN
           MOVE  1 TO WS-RESULT
         ELSE MOVE 0 TO WS-RESULT
         END-IF.

       PANGRAM-END.


       END-OF-PROGRAM.
            STOP RUN.
       END PROGRAM PANGRAM.
