       IDENTIFICATION DIVISION.
       PROGRAM-ID. SCRABBLE-SCORE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *Inputs
       01 WS-WORD   PIC X(60).
      *Outputs
       01 WS-RESULT PIC 99.
       01 THELETTER PIC X.
       01 CONTADOR PIC 99.
       01 SCRABBLE PIC X(26) VALUE "AEIOULNRSTDGBCMPFHVWYKJXQZ".
       01 THEPOSITION PIC 99.
       PROCEDURE DIVISION.


       SCRABBLE-SCORE.

       INITIALIZE CONTADOR THELETTER THEPOSITION WS-RESULT.

       PERFORM VARYING CONTADOR FROM 1 BY 1 UNTIL CONTADOR > 60

         MOVE FUNCTION UPPER-CASE(WS-WORD(CONTADOR:1)) TO THELETTER

         PERFORM VARYING THEPOSITION FROM 1 BY 1 UNTIL THEPOSITION > 26
           IF THELETTER = SCRABBLE(THEPOSITION:1) THEN
             EXIT PERFORM
           END-IF
         END-PERFORM

         EVALUATE THEPOSITION
           WHEN 1 THRU 10
             ADD 1 TO WS-RESULT
           WHEN 11 THRU 12
             ADD 2 TO WS-RESULT
           WHEN 13 THRU 16
             ADD 3 TO WS-RESULT
           WHEN 17 THRU 21
             ADD 4 TO WS-RESULT
           WHEN 22
             ADD 5 TO WS-RESULT
           WHEN 23 THRU 24
             ADD 8 TO WS-RESULT
           WHEN 25 THRU 26
             ADD 10 TO WS-RESULT
         END-EVALUATE

       END-PERFORM.
